npc = [
	ID:'minestone',
	Name:'冰封矿洞杂货店',
	Rank:0,
	Level:0,
	Model:'char/npc/IceN-02/IceN-02.ini',
	SellEtcItem:[
		"PL102"/* 0x04020200 "中级恢复生命药水"*/,
		"PL103"/* 0x04020300 "高级恢复生命药水"*/,
		"PL104"/* 0x04020400 "顶级恢复生命药水"*/,
		"PS102"/* 0x04030200 "中级恢复耐力药水"*/,
		"PS103"/* 0x04030300 "高级恢复耐力药水"*/,
		"PS104"/* 0x04030400 "顶级恢复耐力药水"*/,
		"EC101"/* 0x06010100 "回城卷"*/,
		"OS105"/* 0x02350500 "冰晶石"*/,
		"OS106"/* 0x02350600 "玄风石"*/,
		"OS107"/* 0x02350700 "水晶石"*/,
		"OS108"/* 0x02350800 "虎翼石"*/
	],
	Talks:["我在幽拉矿洞迷路了,你可以帮助我吗?"]
]