npc = [
	ID:'ricarden-equip1',
	Name:'铁匠古登',
	Rank:1018,
	Level:0,
	Model:'char/npc/TN-003/TN-003.ini',
	SellAttackItem:[
		"WC101"/* 0x01020100 "爪"*/,
		"WC103"/* 0x01020300 "鱼镰刺"*/,
		"WC105"/* 0x01020500 "玄电爪"*/,
		"WC107"/* 0x01020700 "平手刃"*/,
		"WS101"/* 0x01060100 "短弓"*/,
		"WS103"/* 0x01060300 "手弩"*/,
		"WS105"/* 0x01060500 "战弓"*/,
		"WS107"/* 0x01060700 "射日弓"*/
	],
	SellDefenceItem:[
		"DA102"/* 0x02010200 "战斗服"*/,
		"DA103"/* 0x02010300 "皮甲"*/,
		"DA105"/* 0x02010500 "鱼鳞甲"*/,
		"DA107"/* 0x02010700 "全钢胸铠"*/,
		"DB101"/* 0x02020100 "皮靴"*/,
		"DB103"/* 0x02020300 "精钢靴"*/,
		"DB105"/* 0x02020500 "百兽靴"*/,
		"DB107"/* 0x02020700 "冰火靴"*/,
		"DG101"/* 0x02030100 "手套"*/,
		"DG103"/* 0x02030300 "铁拳套"*/,
		"DG105"/* 0x02030500 "钢指护手"*/,
		"DG107"/* 0x02030700 "百裂护手"*/
	],
	Talks:["随便看看吧~!初学者还是要的~!"]
]