npc = [
	ID:'de5-equip',
	Name:'沙漠武器店',
	Rank:0,
	Level:0,
	Model:'char/npc/MN-003/MN-003.INI',
	SellAttackItem:[
		"WA119"/* 0x01011300 "幽月斧"*/,
		"WC119"/* 0x01021300 "修罗爪"*/,
		"WP120"/* 0x01051400 "炎枪素戋鸣"*/,
		"WS121"/* 0x01061500 "亚罗栖"*/,
		"WS222"/* 0x01071600 "赤焰流星"*/,
		"WT120"/* 0x01081400 "天妒"*/
	],
	SellDefenceItem:[
		"DA120"/* 0x02011400 "炎龙圣铠"*/,
		"DS118"/* 0x02041200 "死神之盾"*/,
		"DG118"/* 0x02031200 "泰坦护手"*/,
		"DB118"/* 0x02021200 "符文之靴"*/
	],
	Talks:["我暂时驻扎在这荒凉的沙漠开了个武器店"]
]