npc = [
	ID:'m_messenger',
	Name:'莉莉丝',
	Rank:0,
	Level:100,
	Model:'char/npc/M_Messenger/M_Messenger.ini',
	SellEtcItem:[
		"BI213"/* 0x080C0D00 "D型染发剂"*/,
		"BI214"/* 0x080C0E00 "E型染发剂"*/,
		"BI215"/* 0x080C0F00 "F型染发剂"*/,
		"BI216"/* 0x080C1000 "G型染发剂"*/,
		"BI217"/* 0x080C1100 "H型染发剂"*/,
		"BI218"/* 0x080C1200 "I型染发剂"*/,
		"BI219"/* 0x080C1300 "J型染发剂"*/,
		"BI220"/* 0x080C1400 "K型染发剂"*/,
		"BI221"/* 0x080C1500 "L型染发剂"*/,
		"BI222"/* 0x080C1600 "M型染发剂"*/,
		"BI101"/* 0x080B0100 "蓝水晶"*/,
		"BI102"/* 0x080B0200 "红水晶"*/
	],
	Talks:["你想要什么道具呢?", "危险的精灵大陆!"]
]