npc = [
	ID:'phillay-equip2',
	Name:'铁匠德弗里安',
	Rank:0,
	Level:0,
	Model:'char/npc/MN-004/MN-004.INI',
	SellAttackItem:[
		"WC102"/* 0x01020200 "虎爪"*/,
		"WC103"/* 0x01020300 "鱼镰刺"*/,
		"WC104"/* 0x01020400 "蛇牙刺"*/
	],
	SellDefenceItem:[
		"DA102"/* 0x02010200 "战斗服"*/,
		"DA103"/* 0x02010300 "皮甲"*/,
		"DA104"/* 0x02010400 "铠甲"*/,
		"DA105"/* 0x02010500 "鱼鳞甲"*/,
		"DB101"/* 0x02020100 "皮靴"*/,
		"DB102"/* 0x02020200 "精灵靴"*/,
		"DB103"/* 0x02020300 "精钢靴"*/,
		"DB104"/* 0x02020400 "精铜靴"*/,
		"DG101"/* 0x02030100 "手套"*/,
		"DG102"/* 0x02030200 "拳套"*/,
		"DG103"/* 0x02030300 "铁拳套"*/,
		"DG104"/* 0x02030400 "银贝护手"*/,
		"DS101"/* 0x02040100 "木盾"*/,
		"DS102"/* 0x02040200 "钉盾"*/,
		"DS103"/* 0x02040300 "圆盾"*/,
		"DS104"/* 0x02040400 "轻盾"*/
	],
	QuestCode:3,
	QuestParam:1,
	Talks:["你好,有什么需要的吗?"]
]