npc = [
	ID:'ruiden-magic',
	Name:'魔法商店',
	Rank:0,
	Level:0,
	Model:'char/npc/MN-008/MN-008.INI',
	SellAttackItem:[
		"WM108"/* 0x01040800 "公正之杖"*/,
		"WM109"/* 0x01040900 "绊胶飘"*/,
		"WM110"/* 0x01040A00 "圣者杖"*/,
		"WM111"/* 0x01040B00 "王者杖"*/,
		"WT106"/* 0x01080600 "精灵标"*/,
		"WT107"/* 0x01080700 "天命标"*/,
		"WT108"/* 0x01080800 "金标"*/,
		"WT109"/* 0x01080900 "酒唱能促"*/,
		"WT110"/* 0x01080A00 "飞云标"*/
	],
	SellDefenceItem:[
		"DA208"/* 0x02050800 "圣女袍"*/,
		"DA209"/* 0x02050900 "学徒披风"*/,
		"DA210"/* 0x02050A00 "信徒披风"*/,
		"OM107"/* 0x03030700 "火星"*/,
		"OM108"/* 0x03030800 "阳炎"*/,
		"OM109"/* 0x03030900 "暗月"*/
	],
	Talks:["要帮忙么?别小看我"]
]