npc = [
	ID:'t_messenger',
	Name:'卡迪',
	Rank:0,
	Level:100,
	Model:'char/npc/T_Messenger/T_Messenger.ini',
	SellEtcItem:[
		"BI104"/* 0x080B0400 "复活卷轴"*/,
		"BI119"/* 0x080B1300 "吸血鬼之牙(1天)"*/,
		"BI121"/* 0x080B1500 "魔法药剂(1天)"*/,
		"BI186"/* 0x080B6600 "耐力药剂(1天)"*/,
		"BI123"/* 0x080B1700 "烟花"*/,
		"BI136"/* 0x080B3400 "锻造熟练(武器)"*/,
		"BI137"/* 0x080B3500 "锻造熟练(盾)"*/,
		"BI138"/* 0x080B3600 "锻造熟练(衣服)"*/,
		"BI139"/* 0x080B3700 "技能之石(初级)"*/,
		"BI140"/* 0x080B3800 "技能之石(中级)"*/,
		"BI141"/* 0x080B3900 "技能之石(高级)"*/,
		"BI162"/* 0x080B4E00 "锻造熟练石(臂环)"*/,
		"BI163"/* 0x080B4F00 "锻造熟练石(护手)"*/,
		"BI164"/* 0x080B5000 "锻造熟练石(鞋子)"*/,
		"BI183"/* 0x080B6300 "魔法圣水(1小时)"*/
	],
	Talks:["现在还能活下来真好"]
]