npc = [
	ID:'bcn03',
	Name:'杂货店',
	Rank:0,
	Level:0,
	Model:'char/npc/Bcn03/Bcn03.INI',
	SellEtcItem:[
		"PL101"/* 0x04020100 "低级复生命药水"*/,
		"PL102"/* 0x04020200 "中级恢复生命药水"*/,
		"PL103"/* 0x04020300 "高级恢复生命药水"*/,
		"PL104"/* 0x04020400 "顶级恢复生命药水"*/,
		"PS101"/* 0x04030100 "低级恢复耐力药水"*/,
		"PS102"/* 0x04030200 "中级恢复耐力药水"*/,
		"PS103"/* 0x04030300 "高级恢复耐力药水"*/,
		"PS104"/* 0x04030400 "顶级恢复耐力药水"*/,
		"FO104"/* 0x03060400 "天仪之力"*/,
		"FO105"/* 0x03060500 "冰晶之力"*/,
		"FO106"/* 0x03060600 "玄风之力"*/,
		"FO107"/* 0x03060700 "水晶之力"*/,
		"EC101"/* 0x06010100 "回城卷"*/,
		"EC104"/* 0x06010400 "回城卷"*/,
		"BC106"/* 0x080A0600 "水晶塔之印"*/,
		"BC107"/* 0x080A0700 "水晶塔之印"*/,
		"BC108"/* 0x080A0800 "水晶塔之印"*/
	],
	Talks:["您好!需要些什么?"]
]