npc = [
	ID:'crystal',
	Name:'水晶女孩',
	Rank:0,
	Level:0,
	Model:'char/npc/MN-005/MN-005.INI',
	SellEtcItem:[
		"GP109"/* 0x08020900 "神秘水晶"*/,
		"GP117"/* 0x08021100 "绿色神秘水晶"*/,
		"GP118"/* 0x08021200 "红色神秘水晶"*/,
		"GP119"/* 0x08021300 "黄色神秘水晶"*/,
		"GP120"/* 0x08021400 "橙色神秘水晶"*/,
		"GP121"/* 0x08021500 "紫色神秘水晶"*/,
		"GP110"/* 0x08020A00 "守护圣徒水晶"*/,
		"GP101"/* 0x08020100 "独角兽水晶"*/,
		"GP102"/* 0x08020200 "魔兽兵水晶"*/,
		"GP103"/* 0x08020300 "浮灵水晶"*/,
		"GP104"/* 0x08020400 "刀斧手水晶"*/,
		"GP105"/* 0x08020500 "魔剑士水晶"*/,
		"GP106"/* 0x08020600 "火灵王水晶"*/,
		"GP107"/* 0x08020700 "独角兽王水晶"*/,
		"GP108"/* 0x08020800 "绿巨人水晶"*/
	],
	Talks:["你收集到怪物水晶了吗?"]
]