npc = [
	ID:'flypitcher-store',
	Name:'杂货店',
	Rank:0,
	Level:0,
	Model:'char/npc/MN-005/MN-005.INI',
	SellEtcItem:[
		"PL101"/* 0x04020100 "低级复生命药水"*/,
		"PL102"/* 0x04020200 "中级恢复生命药水"*/,
		"PL103"/* 0x04020300 "高级恢复生命药水"*/,
		"PL104"/* 0x04020400 "顶级恢复生命药水"*/,
		"PS101"/* 0x04030100 "低级恢复耐力药水"*/,
		"PS102"/* 0x04030200 "中级恢复耐力药水"*/,
		"PS103"/* 0x04030300 "高级恢复耐力药水"*/,
		"PS104"/* 0x04030400 "顶级恢复耐力药水"*/,
		"EC101"/* 0x06010100 "回城卷"*/,
		"EC102"/* 0x06010200 "回城卷"*/,
		"EC104"/* 0x06010400 "回城卷"*/,
		"SE101"/* 0x03070100 "造化石"*/
	],
	Talks:["没人能进入树林西部的蜜蜂洞穴."]
]