npc = [
	ID:'nevisko-magic',
	Name:'魔法商店',
	Rank:0,
	Level:0,
	Model:'char/npc/MN-008/MN-008.INI',
	SellAttackItem:[
		"WM111"/* 0x01040B00 "王者杖"*/,
		"WM112"/* 0x01040C00 "审判之杖"*/,
		"WM113"/* 0x01040D00 "魔蜓杖"*/,
		"WM114"/* 0x01040E00 "混沌之杖"*/,
		"WT111"/* 0x01080B00 "神标"*/,
		"WT112"/* 0x01080C00 "鸩尾标"*/,
		"WT113"/* 0x01080D00 "魔龙标"*/,
		"WT114"/* 0x01080E00 "追月标"*/
	],
	SellDefenceItem:[
		"DA211"/* 0x02050B00 "大法师袍"*/,
		"DA212"/* 0x02050C00 "红莲战袍"*/,
		"DA213"/* 0x02050D00 "幽绿之眼"*/,
		"DA214"/* 0x02050E00 "绯红之眼"*/,
		"OM110"/* 0x03030A00 "蓝色星辰"*/,
		"OM111"/* 0x03030B00 "淬火乌晶"*/,
		"OM112"/* 0x03030C00 "菱晶石"*/,
		"OM113"/* 0x03030D00 "西法路"*/
	],
	Talks:["俺是实在人......"]
]