npc = [
	ID:'phillay-equip1',
	Name:'铁匠巴特兹',
	Rank:1017,
	Level:0,
	Model:'char/npc/MN-003/MN-003.INI',
	SellAttackItem:[
		"WH101"/* 0x01030100 "狼牙棒"*/,
		"WH102"/* 0x01030200 "星刺锤"*/,
		"WH103"/* 0x01030300 "长锤"*/,
		"WH104"/* 0x01030400 "巨灵锤"*/,
		"WH105"/* 0x01030500 "破天锤"*/,
		"WP101"/* 0x01050100 "精制木杖"*/,
		"WP102"/* 0x01050200 "点钢蛇矛"*/,
		"WP103"/* 0x01050300 "鹰嘴矛"*/,
		"WP104"/* 0x01050400 "方天战戟"*/,
		"WP105"/* 0x01050500 "鸠牙战镰"*/,
		"WS202"/* 0x01070200 "蛇行匕首"*/,
		"WS203"/* 0x01070300 "断剑"*/,
		"WS204"/* 0x01070400 "短剑"*/,
		"WS205"/* 0x01070500 "长剑"*/,
		"WT101"/* 0x01080100 "标枪"*/,
		"WT102"/* 0x01080200 "战标"*/,
		"WT103"/* 0x01080300 "长牙标"*/,
		"WT104"/* 0x01080400 "铁标"*/
	],
	SellDefenceItem:[
		"OA201"/* 0x03020100 "皮制臂环"*/,
		"OA202"/* 0x03020200 "精铁臂环"*/,
		"OA203"/* 0x03020300 "倒刃臂环"*/,
		"OA204"/* 0x03020400 "大力臂环"*/
	],
	Talks:["新进的货物,来看一看吧~!"]
]