npc = [
	ID:'ruiden-store',
	Name:'杂货店',
	Rank:0,
	Level:100,
	Model:'char/npc/TN-005/TN-005.ini',
	SellEtcItem:[
		"PL101"/* 0x04020100 "低级复生命药水"*/,
		"PL102"/* 0x04020200 "中级恢复生命药水"*/,
		"PL103"/* 0x04020300 "高级恢复生命药水"*/,
		"PS101"/* 0x04030100 "低级恢复耐力药水"*/,
		"PS102"/* 0x04030200 "中级恢复耐力药水"*/,
		"PS103"/* 0x04030300 "高级恢复耐力药水"*/,
		"EC101"/* 0x06010100 "回城卷"*/,
		"EC104"/* 0x06010400 "回城卷"*/,
		"OS101"/* 0x02350100 "星遗石"*/,
		"FO102"/* 0x03060200 "流云之力"*/,
		"FO103"/* 0x03060300 "海精之力"*/,
		"FO104"/* 0x03060400 "天仪之力"*/
	],
	Talks:["这里可是补给的中转站呀~!"]
]