npc = [
	ID:'yura-store',
	Name:'杂货店',
	Rank:0,
	Level:0,
	Model:'char/npc/IceN-02/IceN-02.ini',
	SellEtcItem:[
		"PL101"/* 0x04020100 "低级复生命药水"*/,
		"PL102"/* 0x04020200 "中级恢复生命药水"*/,
		"PL103"/* 0x04020300 "高级恢复生命药水"*/,
		"PL104"/* 0x04020400 "顶级恢复生命药水"*/,
		"PS101"/* 0x04030100 "低级恢复耐力药水"*/,
		"PS102"/* 0x04030200 "中级恢复耐力药水"*/,
		"PS103"/* 0x04030300 "高级恢复耐力药水"*/,
		"PS104"/* 0x04030400 "顶级恢复耐力药水"*/,
		"OS104"/* 0x02350400 "天仪石"*/,
		"OS105"/* 0x02350500 "冰晶石"*/,
		"OS106"/* 0x02350600 "玄风石"*/,
		"OS107"/* 0x02350700 "水晶石"*/,
		"EC101"/* 0x06010100 "回城卷"*/,
		"EC102"/* 0x06010200 "回城卷"*/,
		"EC104"/* 0x06010400 "回城卷"*/
	],
	Talks:["我们需要勇士来保护我们的城镇!"]
]